{
  "backend/main.mo": "Defines the canister’s data models for jobs, applications, contacts, and profiles, and seeds initial job postings with experience and salary ranges.",
  "backend/migration.mo": "Provides a migration that converts old job postings to the new format by adding salaryRange and a default experienceRange.",
  "feature_evidence.json": "Lists feature evidence records linking features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all frontend files describing their roles and functionality.",
  "frontend/CUSTOM_DOMAIN.md": "Documentation detailing how to map glitchip.in to the deployed IC canister via Cloudflare DNS.",
  "frontend/index.css": "Defines global Tailwind-based styles and color variables for light and dark themes using OKLCH values.",
  "frontend/index.html": "HTML entry file that loads fonts, favicon, and mounts the React application.",
  "frontend/public/.well-known/ic-domains": "Specifies glitchip.in as the permitted custom domain for the canister.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, routes, React Query client, and global theme provider.",
  "frontend/src/components/MarketingLayout.tsx": "Layout wrapper providing header, footer, and page transition around routed pages.",
  "frontend/src/components/PageTransition.tsx": "Applies a fade transition between route changes with reduced-motion support.",
  "frontend/src/components/SafeImage.tsx": "Image component that swaps to a gradient fallback on load failure while preserving layout.",
  "frontend/src/components/SectionReveal.tsx": "A wrapper component that animates its children into view using IntersectionObserver, with reduced-motion fallback.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with company info, services, social links, and a bottom bar.",
  "frontend/src/components/SiteHeader.tsx": "Provides a responsive site header with navigation, logo, and mobile menu via a sheet component.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and provider for Internet Identity auth, managing login state and stored identities.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook that returns whether the user prefers reduced motion using a media query listener.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching jobs, contacts, and submitting forms via the backend actor.",
  "frontend/src/index.css": "Global Tailwind-based styles defining light/dark color systems, motion preferences, and custom utilities.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/CareersPage.tsx": "Implements the careers page with job listings and a detailed application form including education, work history, and resume upload. Manages dialog state, form fields, and submission via job application API hooks.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form and company contact info, handling form submission via API and showing success or error toasts. Includes a hero section and styled layout components.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with hero content, service highlights, and company stats using styled components and images. Provides navigation links to contact and services pages.",
  "frontend/src/pages/ProductsPage.tsx": "Shows a hero section and a 'coming soon' message for future products with placeholder cards. Contains minimal interactivity and focuses on presentation.",
  "frontend/src/pages/ServicesPage.tsx": "Presents detailed service offerings with summaries, capabilities, deliverables, and engagement models. Uses cards and icons to render a structured multi-section services page.",
  "frontend/src/pages/TermsAndConditionsPage.tsx": "Displays terms and conditions for job applications inside a styled card layout. Includes a hero section and static legal content.",
  "frontend/src/pages/WhyUsPage.tsx": "React page rendering the Why Us section with differentiators, process steps, and styled hero/differentiator sections.",
  "frontend/src/utils/jobId.ts": "Provides job ID validation and a helper to return a standardized validation error message.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing site rebuild goals, requirements, architectural notes, known issues, and existing implemented features."
}