{
  "backend/main.mo": "Motoko canister providing job listings, job applications, contact form handling, and user profile management with access control.",
  "feature_evidence.json": "Feature evidence report mapping project requirements to source files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend source files.",
  "frontend/CUSTOM_DOMAIN.md": "Guide for configuring the glitchip.in custom domain via Cloudflare for an Internet Computer canister.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining design tokens, light/dark themes, and base styles.",
  "frontend/index.html": "HTML entry file setting up fonts, favicon, and mounting point for the React app.",
  "frontend/public/.well-known/ic-domains": "IC custom domain configuration file listing glitchip.in.",
  "frontend/src/App.tsx": "Main React entry configuring TanStack Router routes, theme provider, and React Query client.",
  "frontend/src/components/MarketingLayout.tsx": "Layout wrapper adding header, animated page transitions, and footer around all pages.",
  "frontend/src/components/PageTransition.tsx": "Component providing fade transitions between route changes with reduced-motion support.",
  "frontend/src/components/SectionReveal.tsx": "Intersection-observer-based reveal animation component with motion accessibility support.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with company info, service links, social icons, and a dynamic year.",
  "frontend/src/components/SiteHeader.tsx": "Implements a responsive site header with navigation, logo, and mobile menu using a sheet drawer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and persistent identities.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Returns whether the user has enabled reduced-motion preferences using a media query listener.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for jobs, job applications, contact submissions, and company contacts via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables for light/dark modes with motion-reduction utilities.",
  "frontend/src/main.tsx": "Initializes React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CareersPage.tsx": "Displays careers listings and includes a job application dialog with form handling and backend submission.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact page with a form that submits messages via a mutation and displays company contact info. Handles form state, API submission, and success/error toasts.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with a hero section, services overview, stats, and navigation links. Uses animated reveals and static service data.",
  "frontend/src/pages/ProductsPage.tsx": "Displays a products page with a hero section and a 'coming soon' announcement. Includes placeholder cards for future product listings.",
  "frontend/src/pages/ServicesPage.tsx": "Presents detailed service offerings with summaries, capabilities, deliverables, and engagement models. Uses a hero section and animated reveal components.",
  "frontend/src/pages/WhyUsPage.tsx": "Shows key differentiators and process steps explaining why to choose the company. Includes hero section and grid-based content with reveal animations.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL parameters with sessionStorage fallback. Supports both query-string and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, animations, fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project state, high-level website requirements, image assets needed, domain setup notes, and existing feature specifications for the Glitchip marketing site."
}