{
  "backend/main.mo": "Defines the main actor with job postings, applications, contact submissions, and user profiles, plus initial job data structures and types.",
  "backend/migration.mo": "Provides a migration that removes non-placeholder job postings and returns an updated actor state.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files and components.",
  "frontend/CUSTOM_DOMAIN.md": "Documentation describing how to configure the glitchip.in custom domain via Cloudflare for the IC canister.",
  "frontend/index.css": "Global Tailwind-based styles defining color tokens, variables, and dark mode settings.",
  "frontend/index.html": "HTML entrypoint that loads fonts, icons, and boots the main React app.",
  "frontend/public/.well-known/ic-domains": "Specifies glitchip.in as the IC custom domain.",
  "frontend/src/App.tsx": "Sets up the router, theme provider, React Query client, and defines all top-level routes.",
  "frontend/src/components/MarketingLayout.tsx": "Layout wrapper that renders header, footer, and page transitions around children.",
  "frontend/src/components/PageTransition.tsx": "Applies opacity-based transitions between route changes with reduced-motion support.",
  "frontend/src/components/SafeImage.tsx": "Image component that swaps to a gradient placeholder on load failure.",
  "frontend/src/components/SectionReveal.tsx": "Intersection-observer-based component revealing sections with motion‑aware animations.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site's footer with company info, service links, social icons, and a dynamic copyright year.",
  "frontend/src/components/SiteHeader.tsx": "Implements a responsive site header with logo, navigation links, and mobile menu using a sheet drawer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, identity loading, and state management.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Returns whether the user prefers reduced motion by listening to the relevant media query.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching jobs, job details, contact info, and submitting applications or forms via the actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables, base styles, motion-reduction rules, and custom utilities.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CareersPage.tsx": "Implements a careers page listing jobs and providing a detailed multi-section job application form with resume upload and dynamic education/work experience fields.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with validation and submission plus company contact details and a styled hero section.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with hero content, service highlights, stats, and promotional sections using animations and images.",
  "frontend/src/pages/ProductsPage.tsx": "Shows a products landing page with a hero section and 'coming soon' placeholder content for future product listings.",
  "frontend/src/pages/ServicesPage.tsx": "Defines the services page featuring detailed service descriptions, capabilities, deliverables, and engagement models.",
  "frontend/src/pages/TermsAndConditionsPage.tsx": "Presents the terms and conditions for application submission inside a styled card with multiple policy sections.",
  "frontend/src/pages/WhyUsPage.tsx": "React page rendering the Why Us section with hero, differentiators grid, and process steps using UI components and animations.",
  "frontend/src/utils/jobId.ts": "Provides job ID validation and an error message enforcing 6–7 uppercase alphanumeric characters.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and clearing parameters from hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animations, and fonts with plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file storing version info, scope summary, architecture notes, known issues, and existing feature definitions."
}