{
  "kind": "build_request",
  "title": "Remove Frontend/Backend/Mobile Developer job postings from Careers page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-38",
      "text": "Update the Careers page Open Positions list rendering so that the three selected job cards for “Frontend Developer”, “Backend Developer”, and “Mobile App Developer” are not shown on /careers.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Remove the frontend developer, Backend Developer, Mobile App Developer job postings in the careers page"
        ]
      },
      "acceptanceCriteria": [
        "On /careers, the Open Positions grid no longer displays job cards with titles “Frontend Developer”, “Backend Developer”, or “Mobile App Developer”.",
        "Only the remaining job cards (e.g., the VLSI roles returned from the backend) are rendered in the Open Positions section.",
        "No layout gaps or empty placeholders remain where the removed job cards previously appeared."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Ensure the backend job postings returned by getAllJobs() do not include any postings titled “Frontend Developer”, “Backend Developer”, or “Mobile App Developer”, so these roles cannot reappear after refresh/redeploy.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Remove the frontend developer, Backend Developer, Mobile App Developer job postings in the careers page"
        ]
      },
      "acceptanceCriteria": [
        "Calling getAllJobs() does not return any JobPosting whose title is “Frontend Developer”, “Backend Developer”, or “Mobile App Developer”.",
        "After redeploying/upgrading the canister, /careers still does not show the removed roles."
      ]
    }
  ],
  "constraints": [
    "Apply changes only to the Careers page Open Positions/job-card elements referenced by the user-selected XPaths (the three job cards in section[2] of /careers).",
    "Respect the existing single-actor Motoko backend architecture (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or other frontend immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not redesign the Careers page layout beyond removing the specified job postings.",
    "Do not add new job postings or change the content of the remaining VLSI job postings.",
    "Do not change the job application form fields or submission flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}