{
  "kind": "build_request",
  "title": "Fix Careers jobs list regression and add 5 new VLSI engineering job postings",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-31",
      "text": "Fix the regression causing the Careers page jobs list to show no jobs after the recent update by identifying whether the failure is due to React Query/actor readiness, a failed backend call, or a rendering/empty-state bug, and update the frontend and/or backend so job postings reliably appear on /careers.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "The career pages are not showing the jobs after recent update, so just check this issue and update accordingly."
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /careers displays a non-empty list of jobs when jobs exist in the canister.",
        "If the backend call to fetch jobs fails, the UI shows a clear error state (not a blank section) and logs the error for debugging.",
        "If there are truly zero jobs returned, the UI shows an explicit empty-state message (e.g., “No open positions at the moment. Please check back soon.”) instead of appearing broken.",
        "The jobs query executes successfully for anonymous users (not logged in) and does not require Internet Identity to see job listings."
      ]
    },
    {
      "id": "REQ-32",
      "text": "Add support for an explicit experience range to job postings (0–5 years for the new roles) by extending the JobPosting data model and ensuring the Careers UI displays this experience range on the job cards and in the apply dialog/job detail view.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "With exp level from 0-5 years"
        ]
      },
      "acceptanceCriteria": [
        "Backend JobPosting includes a dedicated experience field (or equivalent structured representation) that can represent “0–5 years”.",
        "Careers job cards show the experience range for each job.",
        "The apply dialog/job detail view also shows the experience range for the selected job.",
        "Existing job listing and job lookup endpoints continue to work with the updated JobPosting shape."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Update the seeded/available job postings to include exactly these five roles: Physical Design Engineer, Design Engineer, Design Verification Engineer, DFT Engineer, AI Automation Engineer. Each role must use an experience range of 0–5 years and a salary range of 5–20 (expressed clearly in user-facing text, e.g., “INR 5–20 LPA”), and each must have an appropriate unique Job ID that matches the existing 6–7 character alphanumeric (A–Z, 0–9) format requirement.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Then add, Physical Design Engineer, Design Engineer, Design Verification Engineer, DFT Engineer, AI Automation Engineer. roles,\n\nWith exp level from 0-5 years, salary ranges from 5-20, With appropriate JOB ID's"
        ]
      },
      "acceptanceCriteria": [
        "The backend job list contains these five roles and exposes them via getAllJobs().",
        "Each of the five roles has a unique Job ID that is 6–7 characters and strictly alphanumeric (A–Z, 0–9).",
        "Each of the five roles shows an experience range of 0–5 years in the UI.",
        "Each of the five roles shows a salary range of 5–20 in the UI in clear English formatting (e.g., “INR 5–20 LPA”).",
        "Users can click “Apply Now” and successfully submit an application against any of the five job IDs without backend validation errors."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture: keep all Motoko logic in backend/main.mo (only add backend/migration.mo if an actual state migration is required).",
    "Do not edit files under frontend/src/components/ui, frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths)."
  ],
  "nonGoals": [
    "Adding real-time job updates, push notifications, or chat features.",
    "Implementing a full admin UI for managing job postings (create/update/delete) beyond seeding and retrieval.",
    "Integrating third-party ATS, email delivery, or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}